cask_args appdir: "/Applications"

tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jkfran/killport"
tap "uzimaru0000/tap"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "bat"
brew "chezmoi"
brew "curl"
brew "deno"
brew "direnv"
brew "docker"
brew "exa"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "pango"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "gitui"
brew "gnu-sed"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "hexyl"
brew "python@3.11"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lua-language-server"
brew "neovim"
brew "node-build"
brew "nodenv"
brew "openjdk@11"
brew "php"
brew "python@3.10"
brew "sk"
brew "sshuttle"
brew "starship"
brew "tfenv"
brew "tig"
brew "wasmer"
brew "jkfran/killport/killport"
brew "uzimaru0000/tap/oglens"
brew "uzimaru0000/tap/tv"
cask "1password-cli"
cask "hyper"
cask "iterm2"
cask "ngrok"
cask "visual-studio-code"
cask "google-chrome"
cask "arc"
cask "cron"
cask "figma"
cask "notion"
cask "google-japanese-ime"
cask "raycast"
cask "warp"
cask "hiddenbar"
cask "displaylink"
cask "1password"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "slack"
cask "discord"
vscode "amlovey.shaderlabvscodefree"
vscode "async-aesop.aesop"
vscode "bierner.lit-html"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "clinyong.vscode-css-modules"
vscode "cocopon.iceberg-theme"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dhall.dhall-lang"
vscode "dsvictor94.promela"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "elmTooling.elm-ls-vscode"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "icrawl.discord-vscode"
vscode "jakebathman.mysql-syntax"
vscode "JakeBecker.elixir-ls"
vscode "James-Yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "justusadam.language-haskell"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mathiasfrohlich.Kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mjmcloug.vscode-elixir"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "notZaki.pandocciter"
vscode "nwolverson.ide-purescript"
vscode "nwolverson.language-purescript"
vscode "octref.vetur"
vscode "Orta.vscode-jest"
vscode "pizzacat83.codic"
vscode "Prisma.prisma"
vscode "qingpeng.common-lisp"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "samverschueren.ava"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SirTobi.pegjs-language"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "tauri-apps.tauri-vscode"
vscode "torn4dom4n.latex-support"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "william-voyek.vscode-nginx"
vscode "yoavbls.pretty-ts-errors"
vscode "ZixuanChen.vitest-explorer"
vscode "znck.grammarly"
